contracts/sll/clinicalprocess/healthcond/actoutcome/schemas/interactions/GetMicroBiologiLabOrderOutcomeInteraction/GetMicroBiologiLabOrderOutcomeInteraction_1.0_RIVTABP21.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. Stockholms Läns Landsting licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->		
<wsdl:definitions name='GetMicroBiologiLabOrderOutcomeInteraction' xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' xmlns:xs='http://www.w3.org/2001/XMLSchema' xmlns:tjsr='urn:sll:clinicalprocess:healthcond:actoutcome:GetMicroBiologiLabOrderOutcomeResponder:1' xmlns:tjsi='urn:sll:clinicalprocess:healthcond:actoutcome:GetMicroBiologiLabOrderOutcomeInitiator:1' xmlns:tns='urn:sll:clinicalprocess:healthcond:actoutcome:GetMicroBiologiLabOrderOutcome:1:rivtabp21' targetNamespace='urn:sll:clinicalprocess:healthcond:actoutcome:GetMicroBiologiLabOrderOutcome:1:rivtabp21' xmlns:itr='urn:riv:itintegration:registry:1'>
  <!-- <xs:annotation>
    <xs:documentation>
			 Tjänsteinteraktionens namn: GetMicroBiologiLabOrderOutcomeInteraction
			 Beskrivning: 
			 Revisioner: 
			 Tjänstedomän: clinicalprocess:healthcond:actoutcome:
			 Tjänsteinteraktionstyp: Fråga-Svar
			 WS-profil: RIVTABP21
			 Förvaltas av: Stockholms Läns Landsting
			 </xs:documentation>
  </xs:annotation>
  -->
  <wsdl:types>
    <xs:schema targetNamespace='urn:sll:clinicalprocess:healthcond:actoutcome:GetMicroBiologiLabOrderOutcome:1:rivtabp21'>
      <xs:import schemaLocation='GetMicroBiologiLabOrderOutcomeResponder_1.0.xsd' namespace='urn:sll:clinicalprocess:healthcond:actoutcome:GetMicroBiologiLabOrderOutcomeResponder:1' />
      <xs:import schemaLocation='../../core_components/itintegration_registry_1.0.xsd' namespace='urn:riv:itintegration:registry:1' />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name='GetMicroBiologiLabOrderOutcomeRequest'>
    <wsdl:part name='LogicalAddress' element='itr:LogicalAddress'>
      <wsdl:documentation>The organisation number of the receiving insurance institution</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name='parameters' element='tjsr:GetMicroBiologiLabOrderOutcome' />
  </wsdl:message>
  <wsdl:message name='GetMicroBiologiLabOrderOutcomeResponse'>
    <wsdl:part name='parameters' element='tjsr:GetMicroBiologiLabOrderOutcomeResponse' />
  </wsdl:message>
  <wsdl:portType name='GetMicroBiologiLabOrderOutcomeResponderInterface'>
    <wsdl:operation name='GetMicroBiologiLabOrderOutcome'>
      <wsdl:input message='tns:GetMicroBiologiLabOrderOutcomeRequest' />
      <wsdl:output message='tns:GetMicroBiologiLabOrderOutcomeResponse' />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name='GetMicroBiologiLabOrderOutcomeResponderBinding' type='tns:GetMicroBiologiLabOrderOutcomeResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
    <wsdl:operation name='GetMicroBiologiLabOrderOutcome'>
      <soap:operation soapAction='urn:sll:clinicalprocess:healthcond:actoutcome:GetMicroBiologiLabOrderOutcomeResponder:1:GetMicroBiologiLabOrderOutcome' style='document' />
      <wsdl:input>
        <soap:header use='literal' message='tns:GetMicroBiologiLabOrderOutcomeRequest' part='LogicalAddress' />
        <soap:body use='literal' parts='parameters' />
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal' />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name='GetMicroBiologiLabOrderOutcomeResponderService'>
    <wsdl:port name='GetMicroBiologiLabOrderOutcomeResponderPort' binding='tns:GetMicroBiologiLabOrderOutcomeResponderBinding'>
      <soap:address location='http://tempuri.org' />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>